var SalerArr=[{
    "name": "北京市",
    "id": "110000",
    "cities": [{
        "name": "北京市",
        "id": "110100",
        "shops": [{
            "name": "北京京申宝汽车销售服务有限公司",
            "id": "6302454"
        }, {
            "name": "北京国服信汽车贸易有限公司",
            "id": "6301533"
        }, {
            "name": "北京页川瑞德汽车销售服务有限公司",
            "id": "6300942"
        }, {
            "name": "北京市艾潇汽车有限公司",
            "id": "6301566"
        }, {
            "name": "北京万通洪力汽车销售服务有限公司",
            "id": "6304833"
        }, {
            "name": "北京真浩泰汽车销售有限公司",
            "id": "6302721"
        }, {
            "name": "北京海文捷汽车销售服务有限公司",
            "id": "6300960"
        }, {
            "name": "北京上汽丰华汽车销售服务有限公司",
            "id": "6300927"
        }, {
            "name": "北京骏宝捷汽车销售服务有限公司",
            "id": "6302478"
        }]
    }]
}, {
    "name": "天津市",
    "id": "120000",
    "cities": [{
        "name": "天津市",
        "id": "120100",
        "shops": [{
            "name": "天津市高德汽车贸易有限公司",
            "id": "6903321"
        }, {
            "name": "天津市远德汽车贸易有限公司",
            "id": "6901827"
        }, {
            "name": "天津市宝通汽车销售服务有限公司",
            "id": "6901224"
        }, {
            "name": "天津捷世华汽车销售服务有限公司",
            "id": "6902124"
        }]
    }]
}, {
    "name": "辽宁省",
    "id": "210000",
    "cities": [{
        "name": "鞍山市",
        "id": "210300",
        "shops": [{
            "name": "鞍山市牧欧汽车销售服务有限公司",
            "id": "6330921"
        }]
    }, {
        "name": "大连市",
        "id": "210200",
        "shops": [{
            "name": "大连兆远汽车销售服务有限公司",
            "id": "6330630"
        }]
    }, {
        "name": "沈阳市",
        "id": "210100",
        "shops": [{
            "name": "辽宁众志诚汽车销售服务有限公司",
            "id": "6330333"
        }, {
            "name": "沈阳天广德众汽车销售服务有限公司",
            "id": "6330369"
        }, {
            "name": "辽宁上辽汽车销售服务有限公司",
            "id": "6330357"
        }, {
            "name": "辽宁鑫达汽车销售服务有限公司",
            "id": "6330339"
        }]
    }]
}, {
    "name": "黑龙江省",
    "id": "230000",
    "cities": [{
        "name": "哈尔滨市",
        "id": "230100",
        "shops": [{
            "name": "哈尔滨中实汽车销售有限公司",
            "id": "6450339"
        }, {
            "name": "哈尔滨哈得力金运汽车销售有限公司",
            "id": "6450360"
        }]
    }]
}, {
    "name": "吉林省",
    "id": "220000",
    "cities": [{
        "name": "吉林市",
        "id": "220200",
        "shops": [{
            "name": "吉林市沪达汽车销售服务有限公司",
            "id": "6390630"
        }]
    }, {
        "name": "长春市",
        "id": "220100",
        "shops": [{
            "name": "长春市金达洲汽车销售有限责任公司",
            "id": "6390324"
        }, {
            "name": "长春通立德美汽车服务有限公司",
            "id": "6390348"
        }]
    }]
}, {
    "name": "内蒙古自治区",
    "id": "150000",
    "cities": [{
        "name": "包头市",
        "id": "150200",
        "shops": [{
            "name": "包头市东信德茂汽车销售服务有限公司",
            "id": "6030624"
        }]
    }, {
        "name": "鄂尔多斯",
        "id": "150600",
        "shops": [{
            "name": "鄂尔多斯市德力汽车经销服务有限责任公司",
            "id": "6033024"
        }]
    }, {
        "name": "呼和浩特市",
        "id": "150100",
        "shops": [{
            "name": "内蒙古恒茂汽车销售服务有限公司",
            "id": "6030324"
        }, {
            "name": "呼和浩特市坤德汽车销售有限公司",
            "id": "6030336"
        }]
    }]
}, {
    "name": "河北省",
    "id": "130000",
    "cities": [{
        "name": "保定市",
        "id": "130600",
        "shops": [{
            "name": "保定市天择汽车销售服务有限公司",
            "id": "6151227"
        }, {
            "name": "涿州中煤地亨达汽车销售服务有限公司",
            "id": "6151236"
        }]
    }, {
        "name": "沧州市",
        "id": "130900",
        "shops": [{
            "name": "沧州国和众亿汽车销售服务有限公司",
            "id": "6152745"
        }, {
            "name": "沧州兴华汽车销售服务有限公司",
            "id": "6152739"
        }]
    }, {
        "name": "邯郸市",
        "id": "130400",
        "shops": [{
            "name": "邯郸市荣沪汽车销售有限公司",
            "id": "6150648"
        }, {
            "name": "邯郸恒信众和汽车销售服务有限公司",
            "id": "6150636"
        }, {
            "name": "邯郸市隆运汽车销售服务有限公司",
            "id": "6150630"
        }]
    }, {
        "name": "衡水市",
        "id": "131100",
        "shops": [{
            "name": "衡水众鹏汽车销售服务有限责任公司",
            "id": "6153324"
        }]
    }, {
        "name": "廊坊市",
        "id": "131000",
        "shops": [{
            "name": "霸州市盛德汽车销售服务有限公司",
            "id": "6153036"
        }, {
            "name": "廊坊市东方华明汽车修理有限公司",
            "id": "6153030"
        }, {
            "name": "廊坊市盛德基业汽车销售服务有限公司",
            "id": "6153033"
        }]
    }, {
        "name": "秦皇岛市",
        "id": "130300",
        "shops": [{
            "name": "秦皇岛金布汽车销售有限公司",
            "id": "6152433"
        }, {
            "name": "秦皇岛四联通合汽车销售服务有限公司",
            "id": "6152430"
        }]
    }, {
        "name": "石家庄市",
        "id": "130100",
        "shops": [{
            "name": "石家庄申联汽车销售服务有限公司",
            "id": "6150327"
        }, {
            "name": "河北众诚汽车贸易有限公司",
            "id": "6150321"
        }, {
            "name": "河北冀中合力汽车销售维修有限公司",
            "id": "6150330"
        }, {
            "name": "石家庄石汇泽业汽车销售服务有限公司",
            "id": "6150339"
        }, {
            "name": "河北润众汽车销售服务有限公司",
            "id": "6150333"
        }]
    }, {
        "name": "唐山市",
        "id": "130200",
        "shops": [{
            "name": "唐山荣川众德汽车销售服务有限公司",
            "id": "6152142"
        }, {
            "name": "唐山宝峰汽车销售服务有限公司",
            "id": "6152127"
        }]
    }, {
        "name": "邢台市",
        "id": "130500",
        "shops": [{
            "name": "邢台盛华汽车贸易有限责任公司",
            "id": "6150927"
        }]
    }, {
        "name": "张家口市",
        "id": "130700",
        "shops": [{
            "name": "张家口海达汽车销售服务有限公司",
            "id": "6151524"
        }]
    }]
}, {
    "name": "山西省",
    "id": "140000",
    "cities": [{
        "name": "大同市",
        "id": "140200",
        "shops": [{
            "name": "大同市福海汽贸有限责任公司",
            "id": "6090621"
        }, {
            "name": "大同市国贸伟业汽车销售有限责任公司",
            "id": "6090630"
        }]
    }, {
        "name": "太原市",
        "id": "140100",
        "shops": [{
            "name": "山西万国汽车销售服务有限公司",
            "id": "6090321"
        }, {
            "name": "山西新大洋汽车销售有限公司",
            "id": "6090324"
        }, {
            "name": "山西金谷源汽车销售服务有限公司",
            "id": "6090339"
        }, {
            "name": "山西汇众汽车服务有限公司",
            "id": "6090336"
        }]
    }]
}, {
    "name": "浙江省",
    "id": "330000",
    "cities": [{
        "name": "杭州市",
        "id": "330100",
        "shops": [{
            "name": "杭州元麦汽车有限公司",
            "id": "6930390"
        }, {
            "name": "浙江申浙汽车股份有限公司",
            "id": "6930342"
        }, {
            "name": "杭州元泽汽车有限公司",
            "id": "6930357"
        }, {
            "name": "杭州申华汽车有限公司",
            "id": "6930375"
        }, {
            "name": "浙江中汽实业有限公司",
            "id": "6930345"
        }, {
            "name": "浙江康桥傲众汽车销售服务有限公司",
            "id": "6930336"
        }, {
            "name": "杭州金畅汽车有限公司",
            "id": "6930396"
        }, {
            "name": "杭州萧山浦发汽车贸易有限公司",
            "id": "6930321"
        }]
    }, {
        "name": "湖州市",
        "id": "330500",
        "shops": [{
            "name": "湖州永达汽车销售服务有限公司",
            "id": "6931545"
        }, {
            "name": "长兴昌盛汽车销售服务有限公司",
            "id": "6931542"
        }, {
            "name": "湖州力众汽车销售有限公司",
            "id": "6931524"
        }]
    }, {
        "name": "嘉兴市",
        "id": "330400",
        "shops": [{
            "name": "海宁市新国鸿汽车销售服务有限公司",
            "id": "6931236"
        }, {
            "name": "嘉兴市桐乡大中汽车销售服务有限公司",
            "id": "6931230"
        }]
    }, {
        "name": "金华市",
        "id": "330700",
        "shops": [{
            "name": "义乌市众宝汽车销售服务有限公司",
            "id": "6932145"
        }, {
            "name": "金华合众汽车销售服务有限公司",
            "id": "6932127"
        }]
    }, {
        "name": "宁波市",
        "id": "330200",
        "shops": [{
            "name": "宁波腾峰嘉华汽车销售服务有限公司",
            "id": "6930672"
        }, {
            "name": "宁波新众业汽车销售服务有限公司",
            "id": "6930681"
        }, {
            "name": "慈溪市慈众汽车销售服务有限公司",
            "id": "6930636"
        }]
    }, {
        "name": "绍兴市",
        "id": "330600",
        "shops": [{
            "name": "绍兴申浙汽车有限公司",
            "id": "6931830"
        }]
    }, {
        "name": "台州市",
        "id": "331000",
        "shops": [{
            "name": "台州申腾汽车有限公司",
            "id": "6933042"
        }, {
            "name": "台州申浙汽车销售服务有限公司",
            "id": "6933024"
        }]
    }, {
        "name": "温州市",
        "id": "330300",
        "shops": [{
            "name": "温州申腾汽车销售服务有限公司",
            "id": "6930921"
        }, {
            "name": "瑞安市南洋汽车销售服务有限公司",
            "id": "6930945"
        }]
    }]
}, {
    "name": "上海市",
    "id": "310000",
    "cities": [{
        "name": "上海市",
        "id": "310100",
        "shops": [{
            "name": "上海百联沪东汽车销售服务有限公司",
            "id": "6603330"
        }, {
            "name": "上海浦江九隆汽车销售服务有限公司",
            "id": "6603660"
        }, {
            "name": "上海天泽汽车销售服务有限公司",
            "id": "6600939"
        }, {
            "name": "上海协通众盛汽车服务有限公司",
            "id": "6604251"
        }, {
            "name": "上海巴士永达汽车销售服务有限公司",
            "id": "6600342"
        }, {
            "name": "上海西上海众达汽车销售服务有限公司",
            "id": "6604239"
        }, {
            "name": "上海华隆汽车销售服务有限公司",
            "id": "6603657"
        }, {
            "name": "上海锦江汽车销售服务有限公司",
            "id": "6603021"
        }, {
            "name": "上海嘉定华毅汽车销售服务有限公司",
            "id": "6604254"
        }, {
            "name": "上海云峰松江汽车销售服务有限公司",
            "id": "6604821"
        }, {
            "name": "上海冠松汽车服务有限公司",
            "id": "6601821"
        }, {
            "name": "上海大众汽车金桥销售服务有限公司",
            "id": "6603936"
        }]
    }]
}, {
    "name": "广东省",
    "id": "440000",
    "cities": [{
        "name": "东莞市",
        "id": "441900",
        "shops": [{
            "name": "东莞市南方亚飞汽车有限公司",
            "id": "7533030"
        }, {
            "name": "东莞市永轩汽车销售服务有限公司",
            "id": "7533045"
        }, {
            "name": "东莞市瑞德汽车贸易有限公司",
            "id": "7533042"
        }, {
            "name": "东莞市园方汽车销售服务有限公司",
            "id": "7533039"
        }, {
            "name": "东莞市鸿鹰汽车销售服务有限公司",
            "id": "7533021"
        }]
    }, {
        "name": "佛山市",
        "id": "440600",
        "shops": [{
            "name": "佛山雄峰新众汽车有限公司",
            "id": "7533942"
        }, {
            "name": "佛山市广物众凯汽车销售服务有限公司",
            "id": "7533936"
        }, {
            "name": "佛山市乾德汽车销售服务有限公司",
            "id": "7533933"
        }]
    }, {
        "name": "广州市",
        "id": "440100",
        "shops": [{
            "name": "广州市璟众汽车销售服务有限公司",
            "id": "7530360"
        }, {
            "name": "广东广物上联汽车销售服务有限公司",
            "id": "7530384"
        }, {
            "name": "广州和富汽车销售服务有限公司",
            "id": "7530324"
        }, {
            "name": "广州市众道汽车有限公司",
            "id": "7530387"
        }, {
            "name": "广州市众耀汽车销售服务有限公司",
            "id": "7530390"
        }, {
            "name": "广州冠晔汽车销售服务有限公司",
            "id": "7530372"
        }]
    }, {
        "name": "惠州市",
        "id": "441300",
        "shops": [{
            "name": "惠州市恒信德诚汽车销售服务有限公司",
            "id": "7532436"
        }]
    }, {
        "name": "汕头市",
        "id": "440500",
        "shops": [{
            "name": "汕头市众道汽车销售服务有限公司",
            "id": "7531224"
        }]
    }, {
        "name": "深圳市",
        "id": "440300",
        "shops": [{
            "name": "深圳市新大兴工贸发展有限公司",
            "id": "7530624"
        }, {
            "name": "深圳市安联通达汽车销售服务有限公司",
            "id": "7530675"
        }, {
            "name": "深圳市大兴宝丰汽车有限公司",
            "id": "7530672"
        }, {
            "name": "深圳星时代汽车有限公司",
            "id": "7530663"
        }, {
            "name": "深圳市时兴汽车贸易有限公司",
            "id": "7530621"
        }, {
            "name": "深圳市科发汽车销售有限公司",
            "id": "7530678"
        }]
    }, {
        "name": "中山市",
        "id": "442000",
        "shops": [{
            "name": "中山市宝众汽车销售服务有限公司",
            "id": "7533330"
        }]
    }, {
        "name": "珠海市",
        "id": "440400",
        "shops": [{
            "name": "珠海南方汽车有限公司",
            "id": "7530924"
        }]
    }]
}, {
    "name": "福建省",
    "id": "350000",
    "cities": [{
        "name": "福州市",
        "id": "350100",
        "shops": [{
            "name": "福州元泽汽车有限公司",
            "id": "7050342"
        }, {
            "name": "福建世骏汽车有限公司",
            "id": "7050351"
        }]
    }, {
        "name": "泉州市",
        "id": "350500",
        "shops": [{
            "name": "泉州元泽汽车有限公司",
            "id": "7051533"
        }, {
            "name": "泉州盈众福海汽车销售有限公司",
            "id": "7051530"
        }, {
            "name": "福建世腾汽车销售服务有限公司",
            "id": "7051524"
        }]
    }, {
        "name": "厦门市",
        "id": "350200",
        "shops": [{
            "name": "厦门市盈众福海汽车有限公司",
            "id": "7050633"
        }, {
            "name": "福建厦门申闽汽车有限公司",
            "id": "7050630"
        }]
    }]
}, {
    "name": "海南省",
    "id": "460000",
    "cities": [{
        "name": "海口市",
        "id": "460100",
        "shops": [{
            "name": "海南信兴汽车销售有限公司",
            "id": "7710321"
        }]
    }]
}, {
    "name": "河南省",
    "id": "410000",
    "cities": [{
        "name": "安阳市",
        "id": "410500",
        "shops": [{
            "name": "安阳市大众交通有限责任公司",
            "id": "7352427"
        }, {
            "name": "安阳市福尔福德众汽车销售服务有限公司",
            "id": "7352433"
        }]
    }, {
        "name": "南阳市",
        "id": "411300",
        "shops": [{
            "name": "南阳威佳众隆汽车销售服务有限公司",
            "id": "7353939"
        }]
    }, {
        "name": "商丘市",
        "id": "411400",
        "shops": [{
            "name": "商丘乐成汽车销售服务有限公司",
            "id": "7354239"
        }, {
            "name": "商丘恒昌汽车销售服务有限公司",
            "id": "7354221"
        }]
    }, {
        "name": "新乡市",
        "id": "410700",
        "shops": [{
            "name": "新乡上众汽车销售服务有限责任公司",
            "id": "7352124"
        }]
    }, {
        "name": "信阳市",
        "id": "411500",
        "shops": [{
            "name": "信阳润洲汽车销售服务有限公司",
            "id": "7354530"
        }, {
            "name": "信阳市荣昇汽车销售有限公司",
            "id": "7354533"
        }]
    }, {
        "name": "郑州市",
        "id": "410100",
        "shops": [{
            "name": "郑州聚龙实业发展有限公司",
            "id": "7350339"
        }, {
            "name": "郑州东泰汽车销售服务有限公司",
            "id": "7350336"
        }, {
            "name": "河南安吉汽车销售有限公司",
            "id": "7350348"
        }, {
            "name": "河南裕华上联汽车销售服务有限公司",
            "id": "7350324"
        }, {
            "name": "河南豫港华诚汽车销售服务有限公司",
            "id": "7350327"
        }]
    }]
}, {
    "name": "安徽省",
    "id": "340000",
    "cities": [{
        "name": "阜阳市",
        "id": "341200",
        "shops": [{
            "name": "阜阳市伟杰汽车销售有限公司",
            "id": "6693327"
        }]
    }, {
        "name": "合肥市",
        "id": "340100",
        "shops": [{
            "name": "安徽申众和汽车销售服务有限公司",
            "id": "6690336"
        }, {
            "name": "安徽物华汽车服务有限公司",
            "id": "6690333"
        }, {
            "name": "安徽上联汽车销售服务有限公司",
            "id": "6690330"
        }, {
            "name": "安徽智富众成汽车销售服务有限公司",
            "id": "6690321"
        }]
    }, {
        "name": "芜湖市",
        "id": "340200",
        "shops": [{
            "name": "芜湖众爱汽车销售服务有限公司",
            "id": "6691224"
        }]
    }]
}, {
    "name": "江苏省",
    "id": "320000",
    "cities": [{
        "name": "常州市",
        "id": "320400",
        "shops": [{
            "name": "常州众成汽车销售服务有限公司",
            "id": "6633321"
        }, {
            "name": "常州众恒汽车销售服务有限公司",
            "id": "6633342"
        }, {
            "name": "常州外汽新众汽车销售服务有限公司",
            "id": "6633330"
        }]
    }, {
        "name": "淮安市",
        "id": "320800",
        "shops": [{
            "name": "淮安市翔盛润和汽车销售服务有限公司",
            "id": "6631227"
        }, {
            "name": "淮安市宏宇驰众汽车销售服务有限公司",
            "id": "6631224"
        }, {
            "name": "淮安市雨田汽车销售服务有限公司",
            "id": "6631221"
        }]
    }, {
        "name": "南京市",
        "id": "320100",
        "shops": [{
            "name": "江苏安吉汽车销售服务有限公司",
            "id": "6630339"
        }, {
            "name": "南京天众汽车销售服务有限公司",
            "id": "6630369"
        }, {
            "name": "江苏苏舜汽车销售服务有限公司",
            "id": "6630366"
        }, {
            "name": "南京黄埔汽车销售服务有限公司",
            "id": "6630327"
        }]
    }, {
        "name": "南通市",
        "id": "320600",
        "shops": [{
            "name": "南通长江汽车贸易有限公司",
            "id": "6632724"
        }, {
            "name": "如皋长江汽车贸易有限公司",
            "id": "6632757"
        }]
    }, {
        "name": "苏州市",
        "id": "320500",
        "shops": [{
            "name": "苏州华丰汽车销售服务有限公司",
            "id": "6633951"
        }, {
            "name": "昆山昆众汽车销售服务有限公司",
            "id": "6633930"
        }, {
            "name": "太仓文洋申荔汽车销售服务有限公司",
            "id": "6633996"
        }, {
            "name": "苏州华铭汽车销售服务有限公司",
            "id": "6633990"
        }, {
            "name": "昆山市建伟汽车销售租赁有限公司",
            "id": "6633984"
        }]
    }, {
        "name": "泰州市",
        "id": "321200",
        "shops": [{
            "name": "江苏众望汽车销售服务有限公司",
            "id": "6632445"
        }, {
            "name": "泰州众泰汽车销售服务有限公司",
            "id": "6632421"
        }]
    }, {
        "name": "无锡市",
        "id": "320200",
        "shops": [{
            "name": "无锡东方誉众汽车销售服务有限公司",
            "id": "6633639"
        }, {
            "name": "无锡能众汽车销售服务有限公司",
            "id": "6633657"
        }]
    }, {
        "name": "宿迁市",
        "id": "321300",
        "shops": [{
            "name": "宿迁上众腾盛汽车销售服务有限公司",
            "id": "6631524"
        }]
    }, {
        "name": "徐州市",
        "id": "320300",
        "shops": [{
            "name": "徐州恒运汽车销售服务有限公司",
            "id": "6630645"
        }, {
            "name": "徐州金悦汽车销售服务有限公司",
            "id": "6630663"
        }, {
            "name": "徐州沪彭众达汽车销售服务有限公司",
            "id": "6630648"
        }]
    }, {
        "name": "盐城市",
        "id": "320900",
        "shops": [{
            "name": "盐城华兴汽车销售服务有限公司",
            "id": "6631830"
        }]
    }, {
        "name": "扬州市",
        "id": "321000",
        "shops": [{
            "name": "扬州润扬汽车销售有限公司",
            "id": "6632139"
        }]
    }, {
        "name": "镇江市",
        "id": "321100",
        "shops": [{
            "name": "镇江常力汽车销售服务有限公司",
            "id": "6633039"
        }]
    }]
}, {
    "name": "山东省",
    "id": "370000",
    "cities": [{
        "name": "滨州市",
        "id": "371600",
        "shops": [{
            "name": "滨州和硕汽车销售服务有限公司",
            "id": "6754833"
        }]
    }, {
        "name": "德州市",
        "id": "371400",
        "shops": [{
            "name": "德州驭达汽车销售服务有限公司",
            "id": "6753921"
        }, {
            "name": "德州众驰汽车销售服务有限公司",
            "id": "6753924"
        }]
    }, {
        "name": "菏泽市",
        "id": "371700",
        "shops": [{
            "name": "菏泽鲁西南汽车城有限责任公司",
            "id": "6755133"
        }, {
            "name": "菏泽众通汽车销售服务有限公司",
            "id": "6755130"
        }]
    }, {
        "name": "济南市",
        "id": "370100",
        "shops": [{
            "name": "山东银座天逸汽车有限公司",
            "id": "6750345"
        }, {
            "name": "山东润华天众汽车销售服务有限公司",
            "id": "6750324"
        }, {
            "name": "山东鸿发申鲁汽车销售服务有限公司",
            "id": "6750363"
        }, {
            "name": "济南大谦汽车销售服务有限公司",
            "id": "6750360"
        }]
    }, {
        "name": "济宁市",
        "id": "370800",
        "shops": [{
            "name": "济宁润诚汽车销售服务有限公司",
            "id": "6752721"
        }, {
            "name": "济宁交运汽车销售服务有限公司",
            "id": "6752745"
        }]
    }, {
        "name": "聊城市",
        "id": "371500",
        "shops": [{
            "name": "聊城市五州商务汽车销售有限公司",
            "id": "6754524"
        }, {
            "name": "聊城市五州众达汽车销售服务有限公司",
            "id": "6754530"
        }]
    }, {
        "name": "临沂市",
        "id": "371300",
        "shops": [{
            "name": "临沂丰华汽车销售服务有限公司",
            "id": "6754224"
        }, {
            "name": "临沂盛华汽车销售服务有限公司",
            "id": "6754236"
        }]
    }, {
        "name": "青岛市",
        "id": "370200",
        "shops": [{
            "name": "青岛润众汽车销售服务有限公司",
            "id": "6750621"
        }, {
            "name": "青岛晟力达汽车销售服务有限公司",
            "id": "6750663"
        }, {
            "name": "青岛顺驰汽车销售有限公司",
            "id": "6750639"
        }]
    }, {
        "name": "泰安市",
        "id": "370900",
        "shops": [{
            "name": "泰安润之福汽车销售有限公司",
            "id": "6753039"
        }, {
            "name": "泰安金驰汽车销售服务有限公司",
            "id": "6753036"
        }]
    }, {
        "name": "威海市",
        "id": "371000",
        "shops": [{
            "name": "威海鑫通德众汽车贸易有限公司",
            "id": "6752427"
        }]
    }, {
        "name": "潍坊市",
        "id": "370700",
        "shops": [{
            "name": "潍坊广博汽车销售服务有限公司",
            "id": "6751836"
        }, {
            "name": "潍坊市国信汽车销售有限公司",
            "id": "6751857"
        }]
    }, {
        "name": "烟台市",
        "id": "370600",
        "shops": [{
            "name": "烟台金岭汽车销售服务有限公司",
            "id": "6752136"
        }, {
            "name": "烟台华鑫汽车销售服务有限公司",
            "id": "6752133"
        }]
    }, {
        "name": "淄博市",
        "id": "370300",
        "shops": [{
            "name": "淄博英华汽车销售服务有限公司",
            "id": "6750936"
        }, {
            "name": "淄博世纪蓝天汽车销售服务有限公司",
            "id": "6750927"
        }]
    }]
}, {
    "name": "甘肃省",
    "id": "620000",
    "cities": [{
        "name": "兰州市",
        "id": "620100",
        "shops": [{
            "name": "兰州金阜康汽车销售服务有限公司",
            "id": "8190321"
        }, {
            "name": "兰州天祥汽车销售服务有限公司",
            "id": "8190324"
        }, {
            "name": "甘肃仕通德众汽车销售服务有限公司",
            "id": "8190339"
        }]
    }]
}, {
    "name": "新疆维吾尔自治区",
    "id": "650000",
    "cities": [{
        "name": "乌鲁木齐市",
        "id": "650100",
        "shops": [{
            "name": "新疆申新汽车销售服务有限公司",
            "id": "8490330"
        }, {
            "name": "新疆申华汽车销售服务有限责任公司",
            "id": "8490342"
        }]
    }]
}, {
    "name": "陕西省",
    "id": "610000",
    "cities": [{
        "name": "西安市",
        "id": "610100",
        "shops": [{
            "name": "陕西省汽车贸易公司",
            "id": "8130327"
        }, {
            "name": "陕西航天九州汽车销售服务有限公司",
            "id": "8130348"
        }, {
            "name": "西安元泰汽车销售有限公司",
            "id": "8130351"
        }, {
            "name": "西安唐都燕华汽车销售服务有限公司",
            "id": "8130336"
        }]
    }]
}, {
    "name": "青海省",
    "id": "630000",
    "cities": [{
        "name": "西宁市",
        "id": "630100",
        "shops": [{
            "name": "青海物产汽车贸易有限公司",
            "id": "8430327"
        }, {
            "name": "青海金岛兴宝汽车销售有限公司",
            "id": "8430333"
        }]
    }]
}, {
    "name": "宁夏回族自治区",
    "id": "640000",
    "cities": [{
        "name": "银川市",
        "id": "640100",
        "shops": [{
            "name": "宁夏金岛汽车销售有限公司",
            "id": "8250333"
        }, {
            "name": "宁夏金富源汽车销售服务有限公司",
            "id": "8250321"
        }]
    }]
}, {
    "name": "四川省",
    "id": "510000",
    "cities": [{
        "name": "成都市",
        "id": "510100",
        "shops": [{
            "name": "四川广博汽车有限公司",
            "id": "7830378"
        }, {
            "name": "四川申蓉圣飞汽车销售服务有限公司",
            "id": "7830354"
        }, {
            "name": "成都华星西蒙汽车销售服务有限公司",
            "id": "7830375"
        }, {
            "name": "四川精典申众汽车销售服务有限公司",
            "id": "7830321"
        }, {
            "name": "四川省申川汽车销售服务有限公司",
            "id": "7830342"
        }, {
            "name": "成都锦宇兴广汽车销售服务有限公司",
            "id": "7830399"
        }, {
            "name": "成都申蓉兴辰汽车销售服务有限公司",
            "id": "7830327"
        }, {
            "name": "四川申蓉广谷汽车销售服务有限公司",
            "id": "7830381"
        }, {
            "name": "四川长征远景汽车销售服务有限公司",
            "id": "7830336"
        }]
    }]
}, {
    "name": "重庆市",
    "id": "500000",
    "cities": [{
        "name": "重庆市",
        "id": "500100",
        "shops": [{
            "name": "重庆百事达华众汽车销售服务有限公司",
            "id": "7202733"
        }, {
            "name": "重庆博众汽车销售服务有限公司",
            "id": "7201524"
        }, {
            "name": "重庆新威众汽车销售服务有限公司",
            "id": "7200930"
        }, {
            "name": "重庆苏创申众汽车销售服务有限公司",
            "id": "7201827"
        }, {
            "name": "重庆渝众汽车销售服务有限公司",
            "id": "7201527"
        }]
    }]
}, {
    "name": "贵州省",
    "id": "520000",
    "cities": [{
        "name": "贵阳市",
        "id": "520100",
        "shops": [{
            "name": "贵州华通众源汽车贸易服务有限公司",
            "id": "7650357"
        }, {
            "name": "贵州华通华盛汽车贸易服务有限公司",
            "id": "7650360"
        }, {
            "name": "贵州致远利信汽车销售服务有限公司",
            "id": "7650351"
        }]
    }, {
        "name": "遵义市",
        "id": "520300",
        "shops": [{
            "name": "遵义申众汽车销售服务有限公司",
            "id": "7650927"
        }, {
            "name": "遵义大汇众汽车销售服务有限公司",
            "id": "7650936"
        }]
    }]
}, {
    "name": "云南省",
    "id": "530000",
    "cities": [{
        "name": "昆明市",
        "id": "530100",
        "shops": [{
            "name": "云南英茂商务有限公司",
            "id": "7950339"
        }, {
            "name": "云南众锐汽车服务有限公司",
            "id": "7950354"
        }, {
            "name": "云南英茂悦众汽车贸易有限公司",
            "id": "7950351"
        }, {
            "name": "昆明中致远汽车销售服务有限公司",
            "id": "7950372"
        }]
    }]
}, {
    "name": "广西壮族自治区",
    "id": "450000",
    "cities": [{
        "name": "柳州市",
        "id": "450200",
        "shops": [{
            "name": "柳州市桂鹏汽车贸易有限责任公司",
            "id": "7590633"
        }]
    }, {
        "name": "南宁市",
        "id": "450100",
        "shops": [{
            "name": "广西弘德汽车销售服务有限责任公司",
            "id": "7590330"
        }]
    }]
}, {
    "name": "江西省",
    "id": "360000",
    "cities": [{
        "name": "赣州市",
        "id": "360700",
        "shops": [{
            "name": "赣州同益汽车销售服务有限公司",
            "id": "6992127"
        }]
    }, {
        "name": "南昌市",
        "id": "360100",
        "shops": [{
            "name": "江西和平汽车销售服务有限公司",
            "id": "6990324"
        }, {
            "name": "江西广甸宝晟汽车销售服务有限公司",
            "id": "6990348"
        }, {
            "name": "南昌市智敏通汽车销售服务有限公司",
            "id": "6990366"
        }]
    }]
}, {
    "name": "湖南省",
    "id": "430000",
    "cities": [{
        "name": "衡阳市",
        "id": "430400",
        "shops": [{
            "name": "衡阳云界汽车销售服务有限公司",
            "id": "7231230"
        }]
    }, {
        "name": "长沙市",
        "id": "430100",
        "shops": [{
            "name": "湖南腾众汽车销售服务有限公司",
            "id": "7230360"
        }, {
            "name": "湖南兰天众天汽车销售有限公司",
            "id": "7230354"
        }, {
            "name": "湖南星沙众兴汽车销售有限公司",
            "id": "7230336"
        }, {
            "name": "湖南华众汽车销售服务有限公司",
            "id": "7230345"
        }, {
            "name": "湖南申湘兴旺销售有限公司",
            "id": "7230324"
        }]
    }]
}, {
    "name": "湖北省",
    "id": "420000",
    "cities": [{
        "name": "武汉市",
        "id": "420100",
        "shops": [{
            "name": "武汉友芝友汽车贸易服务有限公司",
            "id": "7290387"
        }, {
            "name": "武汉恒信众和汽车销售服务有限公司",
            "id": "7290396"
        }, {
            "name": "武汉汇鼎汽车销售服务有限公司",
            "id": "7290390"
        }, {
            "name": "武汉友芝友谦和汽车贸易有限公司",
            "id": "7290366"
        }]
    }, {
        "name": "襄阳市",
        "id": "420600",
        "shops": [{
            "name": "襄阳恒信众和汽车销售服务有限公司",
            "id": "7290933"
        }]
    }, {
        "name": "宜昌市",
        "id": "420500",
        "shops": [{
            "name": "宜昌恒信众和汽车销售服务有限公司",
            "id": "7291833"
        }]
    }]
}]